[
    {
        "content": "{name= 'John'; age= '18'; country= 'Turkey'; curvisa= 'No'; time_to_get_to_US= '1 year'; reason='university'}"
    },
    {
        "content": "Based on your background and purpose of visit, I recommend applying for an F-1 student visa to study in the United States. As a Turkish national intending to pursue university education in the U.S., the F-1 visa is specifically designed for individuals like you who plan to enroll in academic programs at accredited institutions.\n\nSince you mentioned that you have one year to prepare for your journey, this should provide ample time to research universities, apply, and obtain the necessary documentation for your F-1 visa application. It's important to note that the F-1 visa requires acceptance from a Student and Exchange Visitor Program (SEVP)-certified school and proof of financial means to cover tuition and living expenses during your studies.\n\nAs an F-1 visa holder, you will be allowed to enter the United States up to 30 days before your program start date. Additionally, you may be eligible for Optional Practical Training (OPT) after completing your studies, which can provide valuable work experience in your field of study.\n\nRemember to check the specific requirements and procedures for the F-1 visa on the official website of the U.S. Department of State and consult with your designated school's international student office for guidance throughout the application process. Good luck with your university journey in the United States!"
    },
    {
        "content": "[\n    {\n        \"id\": 1,\n        \"title\": \"**Research SEVP-Certified Schools**\",\n        \"note\": \"Research and compile a list of SEVP-certified schools in the United States that offer programs matching your academic interests and goals.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 1 month\"\n    },\n    {\n        \"id\": 2,\n        \"title\": \"**Apply to SEVP-Certified Schools**\",\n        \"note\": \"Submit applications to the selected SEVP-certified schools that you are interested in attending. Make sure to meet all application deadlines and provide required documents.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 2-3 months\"\n    },\n    {\n        \"id\": 3,\n        \"title\": \"**Receive Acceptance Letter**\",\n        \"note\": \"Once accepted by a SEVP-certified school, obtain the official acceptance letter from the institution. This letter is crucial for your visa application.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 4-6 months\"\n    },\n    {\n        \"id\": 4,\n        \"title\": \"**Secure Sufficient Funding**\",\n        \"note\": \"Demonstrate proof of financial ability to cover tuition fees, living expenses, and other costs for your studies in the United States. This is a key requirement for the F-1 visa application.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 6-8 months\"\n    },\n    {\n        \"id\": 5,\n        \"title\": \"**Complete DS-160 Form**\",\n        \"note\": \"Fill out the DS-160 online nonimmigrant visa application form accurately. You will need the information from this form for your visa interview.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 9-10 months\"\n    },\n    {\n        \"id\": 6,\n        \"title\": \"**Pay Visa Application Fee**\",\n        \"note\": \"Pay the required visa application fee for the F-1 visa. Keep the payment receipt as you will need it for scheduling your visa interview.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 10-11 months\"\n    },\n    {\n        \"id\": 7,\n        \"title\": \"**Schedule Visa Interview**\",\n        \"note\": \"Book an appointment for your visa interview at the nearest U.S. embassy or consulate. Make sure to prepare all necessary documents for the interview.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 11-12 months\"\n    },\n    {\n        \"id\": 8,\n        \"title\": \"**Attend Visa Interview**\",\n        \"note\": \"Attend the scheduled visa interview and answer all questions truthfully and confidently. Provide the required documents, including your acceptance letter and proof of funding.\",\n        \"progress\": 0.0,\n        \"status\": \"notStarted\",\n        \"timeline\": \"Within the next 11-12 months\"\n    }\n]"
    }
]